artillery.yml
config:
  target: "http://localhost:3004"
  phases:
    - duration: 10
      arrivalRate: 1
      name: Warm up (1 req/s)
    - duration: 10
      arrivalRate: 1
      rampTo: 10
      name: Ramp Up load (10 req/s)
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: Second Ramp Up load (100 req/s)
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
      name: Peak Load (1000 req/s)


scenarios:
    - name: "Get Reviews by Product ID"
      flow:
      - post:
          url: "/reviews/{{ $randomNumber(9000000, 10000000)}}"